[
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEgKwy_cycj8O8MxpehL0cZ_fTKOyV4nLX_CWq09r1soQPnoRG8iZphYZPgbdtAH-dj3VKT1JfG8yQCQLzBbATOTUoVDH_yShsHkn2NdllVcGX5LJfwf9s8Ki4trgP8KXn90ZDICb-czAjK2G825LnedTWQjmc4wiKMnSnAm8fyxDsSXTmZsWdyasUyqTQ=s1111",
        "title": "Audemars Piguet Purpld",
        "desc": "Audemars Piguet is one of the most famous high-end watch companies in the world. Created in the Vallée de Joux of the Jura Mountains in Switzerland by Jules-Louis Audemars and Edward Auguste Piguet, AP watches now travel the world on the wrists of the rich and famous, including the likes of Arnold Schwarzenegger, Jay-Z, and James LeBron. What secured AP a seat at the table among the most successful global watch brands was its Royal Oak model. Introduced in 1972, the Royal Oak was the first stainless steel sports watch to be marketed as a luxury timepiece, combining style and durability for the first time ever. ",
        "price": "1200",
        "productBrand": "Vet Vland",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEikF4p8nQkOD3t2d2TTC76pc44BGR6XLRl0LuA5NKEyAI9HTpoRvF2NltiC9oAuieS3rxc54IWUZkAdHCK0HOkPFSTGpaGsTU31lmBcM73KN_O8UUceY5c_JzSLSousIpGIWnsEMYHsMr26oPArFSLoa4aZmeSIM57ZBeM1ZqZ9aRqMSQ5bCkpz-aTJwQ=s1111",
        "title": "IWC Schaffhausen Nixon",
        "desc": "When shopping for a luxury watch, it’s easy to get bogged down in the details: the mechanics and the complex internal workings. But at the end of the day, you also need to ask: does it look good? Does it complement your personal style? An IWC Schaffhausen watch is that rare thing: a luxury accessory that marries flawless functionality with exceptional design. The International Watch Company (IWC) was founded in 1868 by a Bostonian: Florentine Ariosto Jones.",
        "price": "2500",
        "productBrand": "Kit Kat",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEhwpramFQCvuGcaaqOPhu8fwD1M6y08QteZNCb5H_GokVrzee5KczKAWKz9iugj78njZcrOohCAxak3s3M2X0BvYEg-UVE88x6gUivl9NncWE18QthwE5lS-NSrl_Z7VwzpjCwujvyE4rJCy1AthaK7U2SOsPxCrETn9sGMdK9RjCibmfHHfqmDIYn_cQ=s1111",
        "title": "Vacheron Constantin Prasid",
        "desc": "Founded in 1755, Vacheron Constantin is the most established luxury watch brand on this list—and the world’s oldest continuously operating watch-maker. With 265 years of horological expertise behind it, this high-end watch brand has plenty of experience in producing quality and aesthetically outstanding timepieces. But heritage and tradition only get you so far. Indeed, Vacheron Constantin continues to push creative boundaries and develop its technical capabilities, and is unceasing in its delivery of exceptional luxury watches that owners will wear their whole lives. ",
        "price": "2250",
        "productBrand": "Neclos",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEiVp4POQZvMfEY4bsPOfFRuKJ7jk1_Nf5Bvl_Sh_gJYy1FlWdk9v_5YVVutEmK4Cv3LHwRYUdODBr6JmbzhNomVBTQ3nYU6LzkkTjYDhSYD1cA4493ROUw04vNKG8fsn8Njayomgkf4TsHm_7CRSf0RXT6E3nuqwrf1PTw4fKC-K7PdFlCTBx6I29T72g=s1111",
        "title": "Girard-Perregaux Nexus",
        "desc": "Founded in 1791, Girard-Perregaux has been making watches for over 227 years. As you would expect from such an established brand, these are some seriously high-quality timepieces. For Girard-Perregaux, the watch’s movements are just as important as the aesthetics. So much emphasis is placed on the mechanics that the architecture of the watches have become signature features in themselves.The brand is famous for its historic Esmerelda Tourbillon with three gold bridges, awarded a Gold Medal in 1889. And in 1971, the company presented the first quartz watch ever to be produced in Switzerland, and whose 32,768 Hertz frequency has become a benchmark for manufacturers around the world.",
        "price": "1800",
        "productBrand": "Fital Font",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEh4OUfvDBRIMgYKnefJ_Yc_ATs4itDgx1wZ-9B50s68qxODdBeIjiLe8TaQogvhKSsIN8KmUhz4qvCRRhgOswgB-bPrwJLO9e0rLOZb3_ZWOKBU39uNt2pRRQ_W0E6NewHwUPFT02gKEMWfD31Tgxr1UJeL_sLsEeagRHKeScZtGGy7IIspuZt6ujutOQ=s1111",
        "title": "Monos Metro Marksalt",
        "desc": "Founded in 1990, award-winning German brand NOMOS Glashütte was born just two months after the fall of the Berlin Wall. Emerging at the beginning of a new era, NOMOS is known for its disruptive and future-focused designs. The brand produces its own swing system—or escapement—which is one of the most important parts of a mechanical watch because it sets the pace and ensures that the watch ticks accurately. It took the company almost seven years to develop this masterpiece of engineering. NOMOS Glashütte owns several patents for their calibers and have won over 150 awards for their designs. The NOMOS Metro, in particular, accumulated endless prizes for its fusion of contemporary and classic design.",
        "price": "2800",
        "productBrand": "Casio",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEjIE4lINdpKqyrmQoJBDW_EQ4dhFiv06J2VHHw4dItgDoHNq0XtfHP7Na9EoPVXYSLPGPtMlCopl1nLkRusRh77Plnk7eBPTZX9gKbzngpz99U-EY_dykIlSPDdKBo1zrWxu2VZvvnqKdANScasWEwcSQa_DvkdY7K5gtED-JFg7jLkkYfl2H5gO2Pzow=s1111",
        "title": "Baume & Mercier firlax",
        "desc": "Baume & Mercier is a brand that takes delight in mechanical mastery and has an absolute passion for perfection. In fact, on every dial of a Baume & Mercier watch, you’ll find the Greek letter Phi, which represents the Golden Ratio: the concept of divine proportion and harmony. Baume & Mercier is known for the inventive and innovative designs of many of its timepieces. Take the Galaxie or the Stardust, for example, which are rectangular and pear-drop shaped respectively—and both of which are studded with glittering stones. Originally launched by two brothers under the name Baume Brothers, in 1918, they joined forces with Paul Mercier and founded the company we know today. The company quickly established itself as a force to be reckoned with among other horological giants.",
        "price": "28000",
        "productBrand": "Rolex",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEj6TEjLsg-Mxi89TVOSOO6V7vDSMJDr_U7jwVpuEHnZnYCX_N1CH4uyjEjlb7nystfHKYVE8LR9AzOrPgrLXMvGnlbbCbBTzwUGmvOHpS12Z7tk4S0j58SB5HhgXkQUFn51DqFEzn77Lt2gCZ3KNzchjdAPDNeEJE6_KrKXCx6dLGT0hUTGkMWjP_J77w=s1111",
        "title": "Maurice Lacroix Ladix",
        "desc": "One of the most highly-applauded and highly-coveted luxury watch brands for men in the world is Maurice Lacroix. The brand has firmly established itself among the ranks of the best high-end watch businesses today, and the stylised M that the company has taken as its motif has become instantly recognisable. While quite young by horological standards—only 40 years old—thanks to the company’s spirit of perfectionism and passion for innovation, Maurice Lacroix has raced ahead of other wannabe horological stars to secure its status as one of the world’s top luxury watch brands. n 2008, the company was awarded the prestigious Goldene Unruh of Germany for its ML128 caliber. Wearers of this watch are able to switch between the ‘time’ and the ‘chrono’ function seamlessly.",
        "price": "1100",
        "productBrand": "Neptune",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEipIxwefouZQbUaNyRfUFp3B7GgWoP6I87awzT17Dqcqm25ZYJN2eiMGEMGdCWDXRl8g3IY9XXHFgkwCx2LWmefPLdguSfqpQKlZ2WcGyodeLGYTNRLCOpsNNJ_MiKcoCm42s7iBTLR6dkFpPhS1t_LYqd5f4IJlYpEFbQaqbGOgbhlsQwfB3WDMKMPEg=s1111",
        "title": "Maurice de Mauriac Gurlc",
        "desc": "Maurice de Mauriac stands out from the other brands on this list of popular men’s watch brands for several reasons. Firstly, the founder, Daniel Dreifuss, used to work as a banker in New York before the financial crash convinced him to move back home to Zurich and start something different. The brand is known for its minimalist designs. The emphasis is on sleek and streamlined functionality. Not that they aren’t also luxurious, with eye-catching straps in materials such as cowskin, Nappa, and crocodile leather.",
        "price": "1800",
        "productBrand": "Rolex",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEiisEBvD7OdOTCeJfoA9CUJWyOpQuhWI2ZwAvI7RPoXJfinH5DXRi3rkQRH9mjV6D0JL5o5CfvadpxKP3svKXxDIzPk30A_b8rv7jCuqmjDuCPZ3knuqME8MKpoFXVekYpnzL1IJBzzilQL1zt4WTpDwifGWXjui23YQ53UvZyh6eJurvVR_JqHqsx2Sg=s1111",
        "title": "Parmigiani Fleurier Mate",
        "desc": "Parmigiani Fleurier is a brand dedicated to producing beautiful and technologically exceptional timepieces, and is one of the most well-respected watch-makers within the industry. Michel Parmigiani is well known as a restorer of antique timepieces and this profound knowledge of the inner mechanisms of historic watches has helped inform his designs. The brand is perhaps best known for the Bugatti 370, inspired by the Bugatti racing cars. Assembled along a horizontal axis and in a tubular formation—similar to a car’s engine—it was a ground-breaking design and is still considered a sensational bit of watch-making today.",
        "price": "2500",
        "productBrand": "Casio",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEg9SQd-Y0s9AfEqXRBs6pxLtAo0WWw5wAtBtMHWNcE2OjF-a4H6uQZeTJVevXJU9UMley_YQMm0uK0OBOJzcirS2EdCTdRZZuoyJ6DXvbNWGzJPNUJOjNSQdLYn2lcHtBCUkoa0P0zQlVbxgiEj18oK7bXxRIKVOagg-a0j0u1Eqkb_SuG5oIzmThGFAQ=s1111",
        "title": "Van Cleef & Arpels vca",
        "desc": "Founded in 1896 in Paris by Alfred Van Cleef and Estelle Arpels, just one year after they got married, romance is at the heart of the Van Cleef & Arpels aesthetic. The brand became an international success soon after launching, with fans fawning over its intricate and unique designs that conveyed an artistic sensibility and playful creativity. The company was even given the task of creating a crown for Empress Farah Pahlavi in 1967. The brand is known for its designs inspired by nature and fantasy, with creations featuring flowers, fairies, and other poetic scenes. Check out the Van Cleef & Arpels Pont des Amoureux, for example. In this watch, two minutely sculpted gold lovers unite for a kiss at midnight on a bridge in Paris. It’s a true piece of artistry that demonstrates not only VCA’s superb technical skill but also its imaginative and inventive designs. ",
        "price": "1240",
        "productBrand": "Neptune",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEh8MpF_QYQF5a_gdXyTklbVgUDYHcAIrkOCPiuxbioqhKdaJgg0XDSdQjzE0AYBxjZcQ1N_U0wOZcFkSUhqV6JMINiWepb80JCfqtB2-uQ-ihzUUH1FrxA_t10kDe-RzIAKOh3bh9qMbwCksEcB-cDO0KUD2owVIDIeQFZnOdjQvKFeGPIxH0CHrbmYkg=s1111",
        "title": "Bovet Fleurier Torque",
        "desc": "Bovet began life in the 19th century, making pocket watches for the Chinese market, and its early clientele included the Emperor of China. Today. Bovet isn’t the world’s most famous watch company but it remains highly distinguished, with unique creations that have won the brand its fair share of admirers. What makes Bovet special is its intricate dials, miniature paintings, and seven-day tourbillon. Bovet was one of the first watch maisons to create highly decorative movements – and to offer skeletonized timepieces to show them off. One of its most stand-out accomplishments was the creation of the Amadeo convertible system, which allows wearers to transform their timepiece into a table clock, necklace watch, pocket watch, and reversible wristwatch, all without the use of a tool.",
        "price": "1250",
        "productBrand": "Elephant",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    },
    {
        "img": "https://blogger.googleusercontent.com/img/a/AVvXsEiqs65Gxo6w8idc8D90co1JP61wToxsVYjLBIWkwA-WPUhIqIjGq4Yz6CQYb7aZwM4oNdRizGDvZo_9EdWYRbnZlZDWNDxhYm15UZXwapYchT27DcaniCQoa4jSk2lQDcNerf1FNLAbo8gF5WLNdsAkS9cQEf0c_l25-BmnzeSBgxwnIu1Rok-8OWX7hg=s1111",
        "title": "Louis Vuitton Vissus",
        "desc": "Even if you’re not an avid follower of high fashion, you could probably draw the famous monogram of luxury label Louis Vuitton from memory. Those instantly recognisable brown leather bags can be found across the globe. But iconic luggage isn’t the end of the story for Louis Vuitton. One of the world’s most famous luxury brands, it’s no small surprise that the company is behind some of the world’s best luxury watches too. The brand positions itself as an unrivalled expert in questions of taste and style. And so it’s to be expected that Louis Vuitton watches are perfect examples of how craftsmanship and artistry can come together to create a luxury accessory that also happens to tell the time. ",
        "price": "2500",
        "productBrand": "TikTok",
        "productMaterial": "Stainless Steel",
        "boxContent": "Watch"
    }
]